[
"What do you call an ant who fights crime? A vigilanty!",
"What is fast, loud and crunchy? A rocket chip",
"Why did the teddy bear say no to dessert? Because she was stuffed.",
"What has ears but cannot hear? A cornfield.",
"What did the left eye say to the right eye? Between us, something smells!",
"What do you get when you cross a vampire and a snowman Frost bite!",
"What did one plate say to the other plate? Dinner is on me!",
"Why did the student eat his homework? Because the teacher told him it was a piece of cake!",
"When you look for something, why is it always in the last place you look? Because when you find it, you stop looking.",
"What is brown, hairy and wears sunglasses? A coconut on vacation.",
"Two pickles fell out of a jar onto the floor. What did one say to the other? Dill with it.",
"What did the Dalmatian say after lunch? That hit the spot!",
"Why did the kid cross the playground? To get to the other slide.",
"How does a vampire start a letter? Tomb it may concern...",
"What do you call a droid that takes the long way around? R2 detour.",
"How do you stop an astronaut’s baby from crying? You rocket!",
"Why was 6 afraid of 7? Because 7, 8, 9",
"18. What is a witch’s favorite subject in school Spelling!",
"When does a joke become a “dad” joke? When the punchline is a parent.",
"How do you make a lemon drop? Just let it fall.",
"What did the limestone say to the geologist? Don’t take me for granite!",
"What do you call a duck that gets all A’s? A wise quacker.",
"Why does a seagull fly over the sea? Because if it flew over the bay, it would be a baygull.",
"What kind of water cannot freeze? Hot water.",
"What kind of tree fits in your hand? A palm tree!",
"Why did the cookie go to the hospital? Because he felt crummy.",
"Why was the baby strawberry crying? Because her parents were in a jam.",
"What did the little corn say to the mama corn? Where is pop corn?",
"What is worse than raining cats and dogs? Hailing taxis!",
"How much does it cost a pirate to get his ears pierced? About a buck an ear.",
"A guy goes to his doctor because he can see into the future. The doctor asks him, How long have you suffered from that condition? The guy tells him, since next Monday.",
"What do sprinters eat before a race? Nothing, they fast!",
"What concert costs just 45 cents? 50 Cent featuring Nickelback!",
"What do you call a mac n cheese that gets all up in your face? Too close for comfort food!",
"Did you hear about the restaurant on the moon? Great food, no atmosphere!",
"Why couldn't the bicycle stand up by itself? It was two tired!",
"Did you hear about the restaurant on the moon? Great food, no atmosphere!",
"Why do melons have weddings? Because they cantaloupe!",
"What happens when you go to the bathroom in France? Euro**peen**.",
"What's the difference between a poorly dressed man on a tricycle and a well-dressed man on a bicycle? Attire!",
"How many apples grow on a tree? All of them!",
"Did you hear the rumor about butter? Well, I'm not going to spread it!",
"How did Burger King get Dairy Queen pregnant? He forgot to wrap his whopper.",
"How is a woman like a road? They both have manholes.",
"Why are men like diapers? They’re usually full of shit, but thankfully disposable.",
"What type of bird gives the best head? A swallow.",
"What’s better than a cold Bud? A warm bush.",
"How do you get a nun pregnant? Dress her up like an altar boy.",
"What should you do if you come across an elephant?Apologize and wipe it off.",
"What do a bungee jump and a hooker have in common? They’re both cheap, fast, and if the rubber breaks, you’re pretty much screwed.",
"How are gay people like mice? They both hate pussies.",
"What did one butt cheek say to the other? Together, we can stop this shit.",
"What’s the difference between your job and a dead prostitute? Your job still sucks.",
"What do you call a cheap circumcision? A rip-off.",
"What do priests and McDonald’s have in common? They both stick their meat in 10-year-old buns.",
"How is tightrope walking like getting a blowjob from someone ugly?If you want to enjoy either, you absolutely can’t look down.",
"What did one of the prostitute’s knees say to the other? How come we spend so little time together?",
"What do you call two men fighting over a slut? Tug-of-whore.",
"Why did the woman leave her husband after he spent all their money on a penis enlarger? She just couldn’t take it any longer.",
"Why don’t little girls fart? They don’t get assholes til they’re married.",
"What do you call an incestuous nephew? An aunt-eater.",
"What do you do with a year’s worth of used condoms? Melt them into a tire and call it a goodyear.",
"What do you call a nanny with breast implants? A faux-pair.",
"How is being in the military like getting a blowjob? The closer you get to discharge, the better you feel.",
"What do women and noodles have in common? Both wiggle when you eat them.",
"What do you get when you jingle a man’s balls? A white Christmas.",
"What’s the difference between a rabbi and a priest? A rabbi cuts them off. A priest sucks them off.",
"What do you call a guy who cries when he masturbates? A tearjerker.",
"What did one broke hooker say to the other? Can you lend me ten bucks ‘til I’m on my back again?",
"Why does Miss Piggy douche with honey? Because Kermit likes his pork sweet and sour.",
"What’s the real definition of a male chauvinist pig? A man who hates every bone in a woman’s body—except his.",
"What does a slut say when her daughter asks how to spell penis? I wish you’d asked me last night, when it was on the tip of my tongue.”",
"Light travels faster than sound. That's why some people appear bright until you hear them speak.",
"I was wondering why the ball was getting bigger. Then it hit me.",
"I have a few jokes about unemployed people, but none of them work.",
"'I have a split personality' said Tom, being frank.",
"How do you make holy water? You boil the hell out of it.",
"I Renamed my iPod The Titanic, so when I plug it in, it says “The Titanic is syncing. Then it started playing ice ice baby...”",
"When life gives you melons, you're dyslexic.",
"Last night, I dreamed I was swimming in an ocean of orange soda. But it was just a Fanta sea.",
"Will glass coffins be a success? Remains to be seen.",
"I lost my job at the bank on my very first day. A woman asked me to check her balance, so I pushed her over.",
"It's hard to explain puns to kleptomaniacs because they always take things, literally.",
"Two windmills are standing in a wind farm. One asks, “What’s your favorite kind of music?” The other says, “I’m a big metal fan.”",
"What’s the difference between a hippo and a zippo? One is really heavy and the other is a little lighter.",
"Did you hear about the guy whose whole left side was cut off? He’s all right now.",
"I can’t believe I got fired from the calendar factory. All I did was take a day off.",
"The man who survived pepper spray and mustard gas is now a seasoned veteran.",
"My dad farted in an elevator, it was wrong on so many levels. Guess life has its ups and downs though.",
"I went to buy some camouflage trousers yesterday but couldn't find any.",
"Hear about the new restaurant called Karma? There’s no menu - you get what you deserve.",
"What do you call a bee that can’t make up its mind? A maybee.",
"England doesn't have a kidney bank, but it does have a Liverpool.",
"I tried to sue the airline for losing my luggage. I lost my case.",
"Did you know Cumbria has a place named Cockermouth? Guess she likes cock in her mouth.",
"I tried to sue the airline for losing my luggage. I lost my case, it caused me a lot of baggage.",
"A police officer just knocked on my door and told me my dogs are chasing people on bikes. That’s ridiculous. My dogs don’t even own bikes.",
"Jill broke her finger today, but on the other hand she was completely fine.",
"All chemists know that alcohol is always a solution. Guess alcholics are right.",
"When everything is coming your way, you're in the wrong lane.",
"The furniture store keeps calling me to come back. But all I wanted was one night stand.",
"A cross-eyed teacher couldn’t control his pupils.",
"She had a photographic memory but never developed it.",
"When the past, present, and future go camping they always argue. It's intense tense in tents",
"What did the janitor say when he jumped out of the closet? SUPPLIES!",
"Let me tell you about my grandfather. He was a good man, a brave man. He had the heart of a lion, and a lifetime ban from the zoo.",
"I've got the body of a 16 year old. And if the cops ever find out she's in my basement...I'm in biiiigggg trouble!",
"Is it ignorance or apathy that's destroying the world today? I don't know and don't really care.",
"My dad, unfortunately, passed away when we couldn’t remember his blood type… His last words to us were, “Be positive!”",
"A mean crook going down stairs = A condescending con, descending.",
"I wasn’t originally going to get a brain transplant, but then I changed my mind.",
"There was a kidnapping at school yesterday. Don’t worry, though - he woke up.",
"Which country’s capital has the fastest-growing population? Ireland. Every day it’s Dublin.",
"What do you call the wife of a hippie? A Mississippi.",
"How do you throw a space party? You planet.",
"What do you get when you mix alcohol and literature? Tequila Mockingbird, Ale of Two Cities, A Brief History Of Wine, The Last of The Mojitos.",
"What washes up on tiny beaches? Microwaves.",
"How does an attorney sleep? First he lies on one side, then he lies on the other.",
"My ex-wife still misses me. But her aim is starting to improve.",
"What are the strongest days of the week? Saturday and Sunday, the rest are weekdays.",
"Two fish are in a tank, one says to the other, how do you drive this thing?",
"2 blondes were walking in the woods when they came across some tracks. Its deer tracks. No, it's bear tracks. They were still arguing when the train hit them.",
"I hate how funerals are always at 9 a.m. I'd attend a funeral that early over my dead body! Plus, I'm not really a mourning person.",
"What’s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire.",
"I was going to make a chemistry joke, but since I'm kinda late to the thread, the good ones argon.",
"FUN FACT: Cats are made of iron, lithium, and neon. FeLiNe",
"What do you call an alligator in a vest? An investigator",
"The guy who invented the door knocker got a no-bell prize",
"The other day I tried to make a chemistry joke. It was sodium funny, I slapped my neon that one.",
"I don't suffer from insanity. I enjoy every minute of it.",
"I saw an ad for burial plots, and I thought: “That’s the last thing I need!",
"Need an ark? I Noah guy! Like new, only used for 40 days.",
"Sleeping comes so naturally to me, I could do it with my eyes closed.",
"German sausage jokes are just the wurst.",
"How does Moses make coffee? Hebrews it.",
"I used to be indecisive; now I'm not so sure.",
"I walked into my sister's room and tripped on a bra... It was a booby trap.",
"What do you call the ghost of a chicken? A poultry-geist.",
"Whaddya call a vampire duck? Count quackula.",
"Police were called to a daycare center where a three-year-old was resisting a rest.",
"I'm on a seafood diet. Every time I see food, I eat it.",
"I like European food so I decided to Russia over there because I was Hungary. After Czech'ing the menu I ordered Turkey. When I was Finnished I told the waiter 'Spain good but there is Norway I could eat another bite' Then they Polished off my plates.",
"He who laughs last thinks slowest.",
"Why are frogs so happy? They eat whatever bugs them.",
"The machine at the coin factory just suddenly stopped working, with no explanation. It doesn’t make any cents.",
"What did the grape say when it got stepped on? Nothing - but it let out a little whine.",
"What do you call a super articulate dinosaur? A Thesaurus.",
"Somebody stole all my lamps… I couldn’t be more de-lighted!",
"Why is the number six afraid of seven? Because seven ate nine.",
"What do you call a man with no arms and no legs stuffed in your mailbox? Bill.",
"Why aren’t dogs good dancers? Because they have two left feet!",
"What did one flag say to the other? Nothing, it just waved.",
"I lost my mood ring, and I don't know how I'm feeling about that.",
"Guy walks into a bar and lays a dead giraffe on the floor. The bartender says 'Hey..what's that lyin' there.' The man said 'That's not a lion, it's a giraffe.",
"How was Rome split in two? With a pair of Ceasars.",
"I'm not a doctor but I'm losing my patience.",
"I bought a boat because it was for sail.",
"Being vegetarian was a huge missed-steak.",
"What would you get if you'd put a lawyer in a suit? A lawsuit.",
"I just read that someone in London gets stabbed every 52 seconds. Poor guy.",
"What's red and bad for your teeth? A brick.",
"Why did Mozart kill all of his chickens? When he asked them who the best composer was, they all replied, Bach, Bach, Bach",
"Give a man a match, and he'll be warm for a few hours. Set a man on fire, and he will be warm for the rest of his life.",
"My wife and I have reached the difficult decision that we do not want children. If anybody does, please just send me your contact details and we can drop them off tomorrow.",
"Even people who are good for nothing have the capacity to bring a smile to your face. For instance, when you push them down the stairs.",
"I visited my friend at his new house. He told me to make myself at home. So I threw him out. I hate having visitors.",
"I was reading a great book about an immortal dog the other day. It was impossible to put down.",
"The other day, my wife asked me to pass her lipstick but I accidentally passed her a glue stick. She still isn't talking to me.",
"Never break someone's heart, they only have one. Break their bones instead, they have 206 of them.",
"I'll never forget my Granddad's last words to me just before he died. 'Are you still holding the ladder?'",
"It turns out a major new study recently found that humans eat more bananas than monkeys. It's true. I can't remember the last time I ate a monkey.",
"What's the difference between jelly and jam? You can't jelly a clown into the tiny car.",
"Why was the leper hockey game canceled? There was a face off in the corner.",
"Today was a terrible day. My ex got hit by a bus. And I lost my job as a bus driver!",
"I don't have a carbon footprint. I just drive everywhere.",
"What's the last thing to go through a fly's head as it hits the windshield of a car going 70 mph? Its butt.",
"An apple a day keeps the doctor away. Or at least it does if you throw it hard enough.",
"Why can't orphans play baseball? They don't know where home is.",
"I started crying when dad was cutting onions. Onions was such a good dog.",
"My elderly relatives liked to tease me at weddings, saying, 'You'll be next!' They soon stopped though, once I started doing the same to them at funerals.",
"I was digging in our garden when I found a chest full of gold coins. I was about to run straight home to tell my wife about it, but then I remembered why I was digging in our garden.",
"My grandfather says I'm too reliant on technology. I called him a hypocrite and unplugged his life support.",
"My son, who's into astronomy, asked me how stars die. 'Usually an overdose, son,' I told him.",
"My girlfriend's dog died, so I tried to cheer her up by getting her an identical one. It just made her more upset. She screamed at me, 'What am I supposed to do with two dead dogs?'",
"What's yellow and can't swim? A bus full of children.",
"My friend said that if he went off a cliff, it would be on his own accord. It's a good thing he drives a Civic.",
"What's the difference between me and cancer? My dad didn't beat cancer.",
"My parents raised me as an only child, which really annoyed my younger brother.",
"My grief counselor died yesterday. He was so good at his job I don't even care.",
"Did you hear about Pillsbury Doughboy? He died of a yeast infection.",
"Welcome back to Plastic Surgery Anonymous. Nice to see so many new faces here today!",
"I hate double standards. Burn a body at a crematorium, you're being a respectful friend. Do it at home and you're destroying evidence.",
"My favorite novel is The Hunchback of Notre Dame. I love a protagonist with a twisted back story.",
"A guy walks with a young boy into the woods. The boy turns to him and says, Hey mister, it's getting really dark and I'm scared. The man replies, How do you think I feel? I have to walk back alone.",
"When does a joke become a dad joke? When it leaves and never comes back.",
"I'd like to have kids one day. I don't think I could stand them any longer than that, though.",
"When ordering food at a restaurant, I asked the waiter how they prepare their chicken. Nothing special, he explained. We just tell them they're going to die.",
"What did one butt cheek say to the other? Together, we can stop this shit.",
"What kind of Bees produce milk? Boobees",
"What did the penis say to the condom? Cover me, I’m going in",
"What goes in hard and dry then comes out wet and soft? Chewing gum",
"What’s the difference between your boyfriend and a condom? A. Condoms have evolved: They’re not so thick and insensitive anymore.",
"They say make up sex is the best… Which is lucky, because all my sex is made up",
"I wish you were soap so I could feel you all over me.",
"I may not go down in history, but I’ll go down on you.",
"Let’s play carpenter. First, we’ll get hammered, then I’ll nail you."
]