[
"What is your favorite color?",
"What weird food combinations do you really enjoy?",
"What social stigma does society need to get over?",
"What food have you never eaten but would really like to try?",
"What’s something you really resent paying for?",
"What would a world populated by clones of you be like?",
"Do you think that aliens exist?",
"What are you currently worried about?",
"Where are some unusual places you’ve been?",
"Where do you get your news?",
"What are some red flags to watch out for in daily life?",
"What movie can you watch over and over without ever getting tired of?",
"When you are old, what do you think children will ask you to tell stories about?",
"If you could switch two movie characters, what switch would lead to the most inappropriate movies?",
"What inanimate object would be the most annoying if it played loud upbeat music while being used?",
"When did something start out badly for you but in the end, it was great?",
"How would your country change if everyone, regardless of age, could vote?",
"What animal would be cutest if scaled down to the size of a cat?",
"If your job gave you a surprise three day paid break to rest and recuperate, what would you do with those three days?",
"What’s wrong but sounds right?",
"What’s the most epic way you’ve seen someone quit or be fired?",
"If you couldn’t be convicted of any one type of crime, what criminal charge would you like to be immune to?",
"What’s something that will always be in fashion, no matter how much time passes?",
"What actors or actresses play the same character in almost every movie or show they do?",
"In the past people were buried with the items they would need in the afterlife, what would you want buried with you so you could use it in the afterlife?",
"What’s the best / worst practical joke that you’ve played on someone or that was played on you?",
"Who do you go out of your way to be nice to?",
"Where do you get most of the decorations for your home?",
"What food is delicious but a pain to eat?",
"Who was your craziest / most interesting teacher?",
"What 'old person' things do you do?",
"What was the last photo you took?",
"What is the most amazing slow motion video you’ve seen?",
"Which celebrity do you think is the most down to earth?",
"What would be the worst thing to hear as you are going under anesthesia before heart surgery?",
"What’s the spiciest thing you’ve ever eaten?",
"What’s the most expensive thing you’ve broken?",
"What obstacles would be included in the World’s most amazing obstacle course?",
"What makes you roll your eyes every time you hear it?",
"What do you think you are much better at than you actually are?",
"Should kidneys be able to be bought and sold?",
"What’s the most creative use of emojis you’ve ever seen?",
"When was the last time you got to tell someone “I told you so",
"What riddles do you know?",
"What’s your cure for hiccups?",
"What invention doesn’t get a lot of love, but has greatly improved the world?",
"What’s the most interesting building you’ve ever seen or been in?",
"What mythical creature do you wish actually existed?",
"What are your most important rules when going on a date?",
"How do you judge a person?",
"If someone narrated your life, who would you want to be the narrator?",
"What was the most unsettling film you’ve seen?",
"What unethical experiment would have the biggest positive impact on society as a whole?",
"When was the last time you were snooping, and found something you wish you hadn’t?",
"Which celebrity or band has the worst fan base?",
"What are you interested in that most people aren’t?",
"If you were given a PhD degree, but had no more knowledge of the subject of the degree besides what you have now, what degree would you want to be given to you?",
"What smartphone feature would you actually be excited for a company to implement?",
"What’s something people don’t worry about but really should?",
"What movie quotes do you use on a regular basis?",
"Do you think that children born today will have better or worse lives than their parents?",
"What’s the funniest joke you know by heart?",
"When was the last time you felt you had a new lease on life?",
"What’s the funniest actual name you’ve heard of someone having?",
"Which charity or charitable cause is most deserving of money?",
"What TV show character would it be the most fun to change places with for a week?",
"What was cool when you were young but isn’t cool now?",
"If you were moving to another country, but could only pack one carry-on sized bag, what would you pack?",
"What’s the most ironic thing you’ve seen happen?",
"If magic was real, what spell would you try to learn first?",
"If you were a ghost and could possess people, what would you make them do?",
"What goal do you think humanity is not focused enough on achieving?",
"What problem are you currently grappling with?",
"What character in a movie could have been great, but the actor they cast didn’t fit the role?",
"What game have you spent the most hours playing?",
"What’s the most comfortable bed or chair you’ve ever been in?",
"What’s the craziest conversation you’ve overheard?",
"What’s the hardest you’ve ever worked?",
"What movie, picture, or video always makes you laugh no matter how often you watch it?",
"What artist or band do you always recommend when someone asks for a music recommendation?",
"If you could have an all-expenses paid trip to see any famous world monument, which monument would you choose?",
"If animals could talk, which animal would be the most annoying?",
"What’s the most addicted to a game you’ve ever been?",
"What’s the coldest you’ve ever been?",
"Which protagonist from a book or movie would make the worst roommate?",
"Do you eat food that’s past its expiration date if it still smells and looks fine?",
"What’s the most ridiculous thing you have bought?",
"What’s the funniest comedy skit you’ve seen?",
"What’s the most depressing meal you’ve eaten?",
"What tips or tricks have you picked up from your job / jobs?",
"What outdoor activity haven’t you tried, but would like to?",
"What songs hit you with a wave of nostalgia every time you hear them?",
"What’s the worst backhanded compliment you could give someone?",
"What’s the most interesting documentary you’ve ever watched?",
"What was the last song you sang along to?",
"What’s the funniest thing you’ve done or had happen while your mind was wandering?",
"What app can you not believe someone hasn’t made yet?",
"When was the last time you face palmed?",
"If you were given five million dollars to open a small museum, what kind of museum would you create?",
"Which of your vices or bad habits would be the hardest to give up?",
"What really needs to be modernized?",
"When was the last time you slept more than nine hours?",
"How comfortable are you speaking in front of large groups of people?",
"What’s your worst example of procrastination?",
"Who has zero filter between their brain and mouth?",
"What was your most recent lie?",
"When was the last time you immediately regretted something you said?",
"What would be the best thing you could reasonably expect to find in a cave?",
"What did you think was going to be amazing but turned out to be horrible?",
"What bit of trivia do you know that is very interesting but also very useless?",
"What’s the silliest thing you’ve seen someone get upset about?",
"What animal or plant do you think should be renamed?",
"What was the best thing that happened to you today?",
"As a child, what did you think would be awesome about being an adult, but isn’t as awesome as you thought it would be?",
"When’s censorship warranted?",
"What’s the most boring super hero you can come up with?",
"What would be some of the downsides of certain superpowers?",
"What word is a lot of fun to say?",
"What current trend do you hope will go on for a long time?",
"What actors or actresses can’t play a different character because they played their most famous character too well?",
"Where’s your go to restaurant for amazing food?",
"What’s something that all your friends agree on?",
"What’s your best story from a wedding?",
"What languages do you wish you could speak?",
"What’s the most pleasant sounding accent?",
"What’s something that everyone, absolutely everyone, in the entire world can agree on?",
"What country is the strangest?",
"What’s the funniest word in the English language?",
"What’s some insider knowledge that only people in your line of work have?",
"Who do you wish you could get back into contact with?",
"How do you make yourself sleep when you can’t seem to get to sleep?",
"If people receive a purple heart for bravery, what would other color hearts represent?",
"What are some of the best vacations you’ve had?",
"If there was a book of commandments for the modern world, what would some of the rules be?",
"What’s the craziest video you’ve ever seen?",
"What’s your “Back in my day, we…”?",
"If you could know the truth behind every conspiracy, but you would instantly die if you hinted that you knew the truth, would you want to know?",
"What animal would be the most terrifying if it could speak?",
"What’s the worst hairstyle you’ve ever had?",
"What habit do you have now that you wish you started much earlier?",
"If you were given one thousand acres of land that you didn’t need to pay taxes on but couldn’t sell, what would you do with it?",
"What about the opposite sex confuses you the most?",
"When was the last time you yelled at someone?",
"What’s the opposite of a koala?",
"What kinds of things do you like to cook or are good at cooking?",
"What life skills are rarely taught but extremely useful?",
"What movie universe would be the worst to live out your life in?",
"If you could hack into any one computer, which computer would you choose?",
"Who do you feel like you know even though you’ve never met them?",
"What’s the most ridiculous animal on the planet?",
"What’s the worst thing you’ve eaten out of politeness?",
"What’s the most historic thing that has happened in your lifetime?",
"What happens in your country regularly that people in most countries would find strange or bizarre?",
"What has been blown way out of proportion?",
"When was a time you acted nonchalant but were going crazy inside?",
"What’s about to get much better?",
"What are some clever examples of misdirection you’ve seen?",
"What’s your funniest story involving a car?",
"What would be the click-bait titles of some popular movies?",
"If you built a themed hotel, what would the theme be and what would the rooms look like?",
"What scientific discovery would change the course of humanity overnight if it was discovered?",
"Do you think that humans will ever be able to live together in harmony?",
"What would your perfect bar look like?",
"What’s the scariest non-horror movie?",
"What’s the most amazing true story you’ve heard?",
"What’s the grossest food that you just can’t get enough of?",
"What brand are you most loyal to?",
"What’s the most awkward thing that happens to you on a regular basis?",
"If you had to disappear and start a whole new life, what would you want your new life to look like?",
"What movie or book do you know the most quotes from?",
"What was one of the most interesting concerts you’ve been to?",
"Where are you not welcome anymore?",
"What do you think could be done to improve the media?",
"What’s the most recent show you’ve binge watched?",
"What’s the worst movie trope?",
"What’s a common experience for many people that you’ve never experienced?",
"What are some misconceptions about your hobby?",
"What’s the smartest thing you’ve seen an animal do?",
"What’s the most annoying noise?",
"What’s your haunted house story?",
"What did you Google last?",
"What’s the dumbest thing someone has argued with you about?",
"If money and practicality weren’t a problem, what would be the most interesting way to get around town?",
"What’s the longest rabbit hole you’ve been down?",
"What’s the saddest scene in a movie or TV series?",
"What’s the most frustrating product you own?",
"What inconsequential super power would you like to have?",
"What qualities do all your friends have in common?",
"What odd smell do you really enjoy?",
"What’s the coolest animal you’ve seen in the wild?",
"What’s the best lesson you’ve learned from a work of fiction?",
"What food do you crave most often?",
"Who in your life has the best / worst luck?",
"What fashion trend makes you cringe or laugh every time you see it?",
"What’s your best story of you or someone else trying to be sneaky and failing miserably?",
"Which apocalyptic dystopia do you think is most likely?",
"If you had a HUD that showed three stats about any person you looked at, what three stats would you want it to show?",
"What’s the funniest thing you’ve seen a kid do?",
"What’s your secret talent?",
"What’s the best way you or someone you know has gotten out of a ticket / trouble with the law?",
"Tear gas makes people cry and laughing gas makes people giggle, what other kinds of gases do you wish existed?",
"What’s the most beautiful beach you’ve been to?",
"What’s the most anxiety inducing thing you do on a regular basis?",
"What’s something that everyone agrees we should change, but somehow it never changes?",
"What trend are you tired of?",
"What’s incredibly cheap and you would pay way more for?",
"What’s your grossest bug story?",
"What would the adult version of an ice-cream truck sell and what song would it play?",
"What company do you despise?",
"When was the most inappropriate time you busted out in laughter?",
"What would be an accurate tag line for each month?",
"What’s the most overrated product out on the market?",
"What word do you always misspell?",
"What naps are the most satisfying?",
"What’s the weirdest thing you’ve found lying on the ground / side of the road?",
"What’s the funniest TV show you’ve ever seen?",
"What’s the most embarrassing story from your childhood?",
"What animal is the most majestic?",
"What’s something that everyone knows is true, but we don’t like to admit it?",
"What’s the weirdest text or email you’ve gotten?",
"What always cheers you up when you think about it?",
"What sport could you play the longest in a televised game, without anyone discovering you aren’t a professional athlete?",
"If you could talk to animals and they would understand you, but you couldn’t understand them, what would you do with that power?",
"What’s the most boring sport, and what would you do to make it more exciting?",
"What’s the creepiest tech out there?",
"Who did you use to look up to, but they screwed up and you lost faith in them?",
"What’s fine in small numbers but terrifying in large numbers?",
"Do you like things to be carefully planned or do you prefer to just go with the flow?",
"What animal would you most like to eat?",
"What fictional characters have you had a crush on over the years?",
"What would the box with all your hopes and dreams inside look like?",
"What was the worst shopping experience you’ve ever had?",
"What story you’ve heard has stayed with you and always disturbs you every time you think about it?",
"What was the most important appointment or deadline you missed?",
"If you were a clown themed super hero, what powers would you have?",
"If you could airdrop anything you want, worth two million dollars or less, anywhere you want, what would you airdrop and where would you airdrop it?",
"If you lived in a virtual reality world of your own creation, what would it look like?",
"What escalated very quickly?",
"What two things are terrible when separate but great when you put them together?",
"What did you believe for way too long as a child?",
"What big event do you think will happen soon that most people aren’t expecting?",
"What still makes you cringe when you think back on it?",
"What current trend makes no sense to you?",
"If you owned a restaurant, what kind of food would it serve?",
"Which celebrity is the most likely to have a collection of canes that are just for show?",
"What’s the weirdest crush you’ve had?",
"What do a lot of people have very strong opinions about, even though they know very little about it?",
"What’s your go to casino game?",
"An epic feast is held in your honor, what’s on the table?",
"What’s your favorite holiday movie?",
"Who is the most manipulative person you’ve ever met?",
"Who is the most creative person you know?",
"What’s the funniest pick up line you’ve heard?",
"What seemingly innocent question makes you think “It’s a trap!”?",
"How ambitious are you?",
"What did you like / dislike about where you grew up?",
"What elements of pop culture will be forever tied in your mind to your childhood?",
"What’s your good luck charm?",
"What’s legal now, but probably won’t be in years?",
"Would you want the ability to hear the thoughts of people near you if you couldn’t turn the ability off?",
"When was the last time you stayed up through the entire night?",
"What’s something that people think makes them look cool, but actually has the opposite effect?",
"What’s the oldest thing you own?",
"What has someone borrowed but never given back?",
"Where is the best place you’ve been for taking walks?",
"If cartoon physics suddenly replaced real physics, what are some things you would want to try?",
"What from the present will withstand the test of time?",
"Who in your life is the worst at using technology?",
"What’s the weirdest conversation you’ve eavesdropped on?",
"What just around the corner tech are you eager to get your hands on?",
"What was the darkest movie you’ve ever seen?",
"What do you do when you hear something fall in the middle of the night while you are in bed?",
"What outfit could you put together from clothes you own to get the most laughs?",
"What’s the most disgusting sounding word in the English language?",
"What was ruined because it became popular?",
"What outdated slang do you use on a regular basis?",
"What was the biggest realization you had about yourself?",
"What’s your best example of easy come, easy go?",
"What small change greatly improves a person’s appearance?",
"What topic could you spend hours talking about?",
"What happens regularly that would horrify a person from years ago?",
"What do a lot of people hope will happen but is just not going to happen?",
"What’s the weirdest thing that has happened to you while working at your job?",
"What questions would you like to ask a time traveler from years in the future?",
"Which way should toilet paper hang, over or under?",
"What’s the most physically painful thing you’ve ever experienced?",
"What horror story do you have from a job you’ve had?",
"What’s the most rage inducing game you’ve ever played?",
"What’s the biggest overreaction you’ve ever seen?",
"What are some of the most common misconceptions?",
"What job doesn’t exist now but will exist in the future?",
"What awful movie do you love?",
"What normally delicious food gets ruined when you wrap it in a tortilla?",
"What’s your best example of fake it till you make it?",
"What were you completely certain of until you found out you were wrong?",
"What’s something commonly done that gets progressively weirder the more you think about it?",
"What’s the cutest thing you can imagine?",
"If you were given unlimited resources, how would you lure the worst of humanity into one stadium at the same time?",
"What do you think about when you hear the word “classy”?",
"What near future predictions do you have?",
"What do you need help with most often?",
"What piece of 'art' would you create if you had to pretend to be an artist and submit something to a gallery?",
"What do you do to make the world a better place?",
"What’s the best and worst thing about the country you are from?",
"If you were in charge renaming things so that their names would be more accurate, what names would you come up with?",
"What’s better broken than whole?",
"What values are most important to you?",
"What’s the best sandwich you’ve ever had?",
"What’s the worst thing you ate from a fast food restaurant?",
"What’s something that I don’t know?",
"What profession doesn’t get enough credit or respect?",
"What memory of yours feels real but is most likely false?",
"What’s your 'and then it got worse' story?",
"What was the most amazing physical feat you’ve managed to pull off?",
"What’s the most annoying thing about the social media platform you use most often?",
"If you were hired to show tourists what life is really like where you live, what would you show them / have them do?",
"What would be the most unsettling thing to keep occasionally finding around your house?",
"What nicknames do you have for people in your life?",
"What does the opposite sex do that you wish that you could do, but it’s not anatomically feasible or it’s socially frowned upon?",
"How much do you plan / prepare for the future?",
"What do you hate most and love most about your car?",
"What weird potato chip flavor that doesn’t exist would you like to try?",
"What’s the silliest thing you’ve convinced someone of?",
"How much do you think names affect the outcomes of people’s lives?",
"What product or service is way more expensive than it needs to be?",
"What’s the shadiest thing you’ve seen someone do?",
"What was the last situation where some weird stuff went down and everyone acted like it was normal, and you weren’t sure if you were crazy or everyone around you was crazy?",
"What did you eat so much of that now you hate it?",
"What are some of the dumbest lyrics you’ve heard in a song?",
"Where’s the line between soup and cereal?",
"What word do you always mispronounce?",
"What do you think you do better than % of people?",
"What would be the worst food to be liquefied and drunk through a straw?",
"What’s the weirdest thing about modern life that people just accept as normal?",
"How much of your body would you cybernetically enhance if you could?",
"If you wanted to slowly drive a roommate insane using only notes, what kind of notes would you leave around the house?",
"If you had a giraffe that you needed to hide, where would you hide it?",
"What’s the clumsiest thing you’ve done?",
"What songs do you only know the chorus to?",
"Think of a brand, now what would an honest slogan for that brand be?",
"What’s something common from your childhood that will seem strange to future generations?",
"What’s the most amazing place in nature you’ve been?",
"What’s quickly becoming obsolete?",
"Where is the most uncomfortable place you have ever slept?",
"What’s the most annoying animal you’ve encountered?",
"What’s your best example of correlation not equaling causation?",
"In what situations, do you wish you could throw down a smoke bomb and disappear?",
"When was the last time you were hopelessly lost?",
"What songs do you feel compelled to sing along with when you hear them, even if you don’t totally know all the words?",
"What product do you wish a company would make a 'smart version of'?",
"What two films would you like to combine into one?",
"Who is your hero?",
"If you could live anywhere, where would it be?",
"What is your biggest fear?",
"What is your favorite family vacation?",
"What would you change about yourself if you could?",
"What really makes you angry?",
"What motivates you to work hard?",
"What is your favorite thing about your career?",
"What is your biggest complaint about your job?",
"What is your proudest accomplishment?",
"What is your child's proudest accomplishment?",
"What is your favorite book to read?",
"What makes you laugh the most?",
"What was the last movie you went to? What did you think?",
"What did you want to be when you were small?",
"What does your child want to be when he/she grows up?",
"If you could choose to do anything for a day, what would it be?",
"What is your favorite game or sport to watch and play?",
"Would you rather ride a bike, ride a horse, or drive a car?",
"What would you sing at Karaoke night?",
"What two radio stations do you listen to in the car the most?",
"Which would you rather do: wash dishes, mow the lawn, clean the bathroom, or vacuum the house?",
"If you could hire someone to help you, would it be with cleaning, cooking, or yard work?",
"If you could only eat one meal for the rest of your life, what would it be?",
"Who is your favorite author?",
"Have you ever had a nickname? What is it?",
"Do you like or dislike surprises? Why or why not?",
"In the evening, would you rather play a game, visit a relative, watch a movie, or read?",
"Would you rather vacation in Hawaii or Alaska, and why?",
"Would you rather win the lottery or work at the perfect job? And why?",
"Who would you want to be stranded with on a deserted island?",
"If money was no object, what would you do all day?",
"If you could go back in time, what year would you travel to?",
"How would your friends describe you?",
"What are your hobbies?",
"What is the best gift you have been given?",
"What is the worst gift you have received?",
"Aside from necessities, what one thing could you not go a day without?",
"What are your pet peeves?",
"Where do you see yourself in five years?",
"How many pairs of shoes do you own?",
"If you were a superhero, what powers would you have?",
"What would you do if you won the lottery?",
"What form of public transportation do you prefer (air, boat, train, bus, car, etc)?",
"What's your favorite zoo animal?",
"If you could go back in time to change one thing, what would it be?",
"If you could share a meal with any individuals, living or dead, who would they be?",
"How many pillows do you sleep with?",
"What's the longest you've gone without sleep (and why)?",
"What's the tallest building you've been to the top in?",
"Would you rather trade intelligence for looks or looks for intelligence?",
"How often do you buy clothes?",
"Have you ever had a secret admirer?",
"What's your favorite holiday?",
"What's the most daring thing you've ever done?",
"What was the last thing you recorded on TV?",
"What was the last book you read?",
"What's your favorite type of foreign food?",
"Are you a clean or messy person?",
"Who would you want to play you in a movie of your life?",
"How long does it take you to get ready in the morning?",
"What kitchen appliance do you use every day?",
"What's your favorite fast food chain?",
"What's your favorite family recipe?",
"Do you love or hate rollercoasters?",
"What's your favorite family tradition?",
"What is your favorite childhood memory?",
"What's your favorite movie?",
"How old were you when you learned Santa wasn't real? How did you find out?",
"Is your glass half full or half empty?",
"What's the craziest thing you’ve done in the name of love?",
"What three items would you take with you on a deserted island?",
"What was your favorite subject in school?",
"What's the most unusual thing you've ever eaten?",
"Do you collect anything?",
"Is there anything you wished would come back into fashion?",
"Are you an introvert or an extrovert?",
"Which of the five senses would you say is your strongest?",
"Have you ever had a surprise party? (that was an actual surprise)?",
"Are you related or distantly related to anyone famous?",
"What do you do to keep fit?",
"Does your family have a ‘motto’ – spoken or unspoken?",
"If you were ruler of your own country what would be the first law you would introduce?",
"Who was your favorite teacher in school and why?",
"What three things do you think of the most each day?",
"If you had a warning label, what would yours say?",
"What song would you say best sums you up?",
"What celebrity would you like to meet at Starbucks for a cup of coffee?",
"Who was your first crush?",
"What’s your favorite way to spend a day off?",
"What type of music are you into?",
"What was the best vacation you ever took and why?",
"Where’s the next place on your travel bucket list and why?",
"What are your hobbies, and how did you get into them?",
"What was your favorite age growing up?",
"Was the last thing you read?",
"Would you say you’re more of an extrovert or an introvert?",
"What's your favorite ice cream topping?",
"What was the last TV show you binge-watched?",
"Are you into podcasts or do you only listen to music?",
"Do you have a favorite holiday? Why or why not?",
"If you could only eat one food for the rest of your life, what would it be?",
"Do you like going to the movies or prefer watching at home?",
"What’s your favorite sleeping position?",
"What’s your go-to guilty pleasure?",
"In the summer, would you rather go to the beach or go camping?",
"What’s your favorite quote from a TV show/movie/book?",
"How old were you when you had your first celebrity crush, and who was it?",
"What's one thing that can instantly make your day better?",
"Do you have any pet peeves?",
"Which meal is your favorite: breakfast, lunch, or dinner?",
"What song always gets you out on the dance floor?",
"When you were a kid, did you eat the crusts on your sandwich or not?",
"What activity instantly calms you?",
"Ideally, how would you spend your birthday?",
"What do you do on your commute to/from work?",
"Do you have a favorite type of exercise?",
"What's your favorite season and why?",
"What's the best joke you've ever heard?",
"What's the phone app you use most?",
"Would you rather cook or order in?",
"Have your ever disliked something and then changed your mind?",
"What's your favorite board game?",
"How do you take your coffee?",
"What's your most prized possession and why?",
"Is there any product that you couldn't live without?",
"Do you sleep with a top sheet? Why or why not?",
"If you could have any exotic animal as a pet, which would it be?",
"What would be the first thing you'd do if you won the lottery?",
"What’s your favorite thing about your current job?",
"What annoys you most?",
"What’s the career highlight you’re most proud of?",
"Do you think you’ll stay in your current gig awhile? Why or why not?",
"What type of role do you want to take on after this one?",
"Are you more of a 'work to live' or a 'live to work' type of person?",
"Does your job make you feel happy and fulfilled? Why or why not?",
"How would your -year-old self react to what you do now?",
"What do you remember most about your first job?",
"How old were you when you started working?",
"What’s the worst job you’ve ever had?",
"What originally got you interested in your current field of work?",
"Have you ever had a side hustle or considered having one?",
"What’s your favorite part of the workday?",
"What’s the best career decision you’ve ever made?",
"What’s the worst career decision you’ve ever made?",
"Do you consider yourself good at networking?",
"What career advice would you give to your younger self?",
"Do you believe in having a 'five-year plan'?",
"How do you separate your work life from your home life?",
"When will you know you've 'made it'?",
"Are you looking forward to retiring, or do you plan to work as long as possible?",
"Have you ever had 'imposter syndrome'?",
"What do you think about workaholics?",
"What qualities do you look for in a boss?",
"Do you have a professional mentor? If not, do you want one?",
"Do you have a work best friend?",
"Are you into after-work happy hours?",
"How do you motivate yourself in your career?",
"What's the best career advice you've ever heard?",
"What's the worst career advice you've ever received?",
"When you started your current job, what most surprised you?",
"How do you pick yourself back up after making a mistake at work?",
"How do you deal with work stress?",
"What energizes you about your career?",
"What's one work-related thing you want to accomplish in the next year?",
"Who has had the biggest impact on your career choice?",
"What does your family think of your career?",
"What's the best thing you've learned in your current position?",
"If you could do it all over again, would you pursue the same career? Why or why not?",
"How much time do you spend with your family?",
"Who do you most like spending time with and why?",
"Were you close with your family growing up?",
"How do you define your family now?",
"What traits are most important to you in your family members?",
"Who are you the closest to and why?",
"Do you want a family of your own?",
"What’s your favorite family tradition?",
"If you could change your relationship with a family member, would you? If so, with whom?",
"What was it like growing up as the youngest/oldest/middle/only child?",
"Does your family ever take trips together?",
"What’s your favorite family memory?",
"What TV family most reminds you of your own?",
"Do you ever wish you were raised differently?",
"What’s the best piece of advice a family member has given you?",
"Do you wish you had more siblings? If so, why?",
"Did you ever hide anything from or lie to your parents?",
"If you had a family business, what would it be?",
"Do you and your family have any nicknames for each other?",
"What's your favorite way to spend time with your family?",
"How do you show your family you love them?",
"Have you ever been to a family reunion?",
"What's the most important holiday you spend with your family and why?",
"Who in your family would you describe as a 'character'?",
"How do you feel about family events?",
"What's something your family would be surprised to learn about you?",
"Which family member do you confide in most?",
"How do you deal with arguments between family members?",
"If you have children, how do you want to raise them?",
"What's more important: family or friends?",
"Do you have any friends you would consider family?",
"Has your family ever pressured you to act a certain way?",
"Did you ever get to meet your great-grandparents?",
"What personality traits do you share with your relatives?",
"What physical traits do you share with your relatives?",
"What stories did your family members tell you growing up?",
"How did your parents (and/or grandparents) meet?",
"What makes you proud of your family?",
"Who's the newest member of your family?",
"What can always bring your family together?",
"What’s a relationship deal breaker for you?",
"If you had only one sense (hearing, touch, sight, etc). which would you want?",
"What is your definition of success?",
"What makes you feel at peace?",
"What are you most proud of in the last year?",
"What makes you feel most accomplished?",
"Who do you admire most in the world?",
"Would you rather make more money doing a job you hate or less doing one you love?",
"Which of your personality traits are you most proud of?",
"What’s the first thing you look for in a partner and/or friend?",
"How has your perspective on the world changed over time?",
"Do you live by any piece of advice or motto?",
"How can someone earn your trust?",
"How can someone lose your trust?",
"Would you rather someone be honest and hurt your feelings or lie to protect them?",
"If you could snap your fingers and instantly make the world better, what would you do?",
"Do you believe in astrology? Why or why not?",
"Have you ever lost a friend? If so, what happened?",
"If you could only teach one thing to your (future) child, what would it be?",
"What’s the scariest thing you’ve ever done, and why did you do it?",
"Do you believe in second chances?",
"Where do you get your news?",
"What is your biggest irrational fear?",
"Are you active on social media, or do you prefer to be more private?",
"Do you volunteer at all?",
"Are you an organ donor, and how did you come to that decision?",
"Do you believe you should do one thing a day that scares you?",
"What, if anything, do you think happens after death?",
"What line should someone never cross with you?",
"How do you define beauty?",
"Do you believe in life on other planets?",
"How do you interact with someone who disagrees with you?",
"If you could do anything, besides what you're doing now, what would you do?",
"What do you regret not doing in the last year?",
"What’s on your bucket list?",
"If you had unlimited money to start your own business, what would it be?",
"If you found out today was your last day on Earth, what would you do?",
"If you could live anywhere in the world, where would it be?",
"A genie gives you three wishes—what are they?",
"If you had the opportunity to be immortal, would you take it?",
"Which famous person in history would you want to spend the day with?",
"If you could time travel, when and where would you go?",
"Do you think you'll likely accomplish all your dreams?",
"If you could magically become famous, would you want to?",
"If you could relive one moment in your life, which would it be?",
"If you see a puddle on the ground, do you walk around it or over it?",
"If you could have a super power, what would it be?",
"If you could go back to anytime in history, where would you go?",
"If you came back in your next life as an animal, what animal would you be?",
"If you got to name a new country, how would you decide what to call it?",
"What would be the title of your memoir?",
"Do you hit the snooze button or wake up immediately?",
"What’s the first thing you do in the morning?",
"What’s the last thing you do at night?",
"Do you believe in any conspiracy theories (no judgement)?",
"Do you think iced coffee should only be consumed in the summer or all year round?",
"Would you rather be covered in fur or covered in scales?",
"What’s your idea of a perfect date (yes, of the calendar year)?",
"What’s the most unusual place you’ve fallen asleep?",
"At a party, where can someone find you?",
"Do you wash your legs in the shower?",
"Who would play you in the movie of your life?",
"When making a PB&J sandwich, do you put on the peanut butter or jelly first?",
"Do you have any allergies?",
"Do you trust your own memory? Why or why not?",
"Which fictional character do you relate to most?",
"What, if anything, would make you walk out in the middle of a movie?",
"When was the last time you cried and why?",
"What's your most controversial opinion about something mundane?",
"Do you 'stan' any celebrities?",
"What's your go-to midnight snack?",
"What was your all-time favorite Halloween costume?",
"What's the weirdest thing you do when you're alone?",
"Do you have any recurring dreams?",
"What's the silliest argument you've ever been in?",
"What's the worst argument you've ever been in?",
"What's your opinion on modern art?",
"If you could choose how to die, would you? If so, what would you choose?",
"What's the most ridiculous outfit you've ever worn?",
"What was the first thing you wanted to be when you grew up?",
"If you could own a mythical creature (unicorn, phoenix, etc), which one would you pick?",
"What's your least favorite place in the world?",
"Would you rather have your dishes or clothes be magically clean?",
"What's your favorite story about yourself?",
"If you could change anything about yourself, would you? If so, what and why?"
]